**AASIGNMENT 4**

QUESTION 1

How to import pandas and check the version?

In [ ]:
import pandas as pd
print(pd.__version__)

1.1.4

QUESTION 2 

How to create a series from a numpy array?

In [ ]:
import numpy as np
import pandas as pd
arr = np.array(["a","s","i","s",11,9,10,29,7,'n','h','l','a'])
s = pd.Series(arr)
print (s)

0      a
1      s
2      i
3      s
4     11
5      9
6     10
7     29
8      7
9      n
10     h
11     l
12     a
dtype: object

QUESTION 3

How to convert the index of a series into a column of a dataframe?

In [ ]:
import pandas as pd
df = pd.DataFrame({"Name":["christine","catherine","jungkook","taehyung"],"Roll No.":[1,2,3,4],"Age":[21,20,23,25]})
df

        Name  Roll No.  Age
0  christine         1   21
1  catherine         2   20
2   jungkook         3   23
3   taehyung         4   25

QUESTION 4

Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder)

In [ ]:
import seaborn as sns
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

QUESTION 5

Which country origin cars are a part of this dataset?

In [3]:
import pandas as pd
df = pd.DataFrame({"Cars":["Toyota","Renault- Nissan Alliance","volkswagen Group","Hyundai-kai","Ford","Fiat"],"Origin Countries":["Japan","Japan-France","Germany","South Korea","USA","Italy"],"Founded By":["Kiichiro Toyoda","Yokohawa-Kanagawa","German Labour Front","Chung Ju-yung","Henry Ford","Giovanni Agnelli"]})
df

                       Cars Origin Countries           Founded By
0                    Toyota            Japan      Kiichiro Toyoda
1  Renault- Nissan Alliance     Japan-France    Yokohawa-Kanagawa
2          volkswagen Group          Germany  German Labour Front
3               Hyundai-kai      South Korea        Chung Ju-yung
4                      Ford              USA           Henry Ford
5                      Fiat            Italy     Giovanni Agnelli

QUESTION 6

Extract the part of the dataframe which contains cars belonging to 'usa'

In [24]:
import pandas as pd
df = pd.DataFrame({"Cars":["Toyota","Renault- Nissan Alliance","volkswagen Group","Hyundai-kai","Ford","Fiat"],"Origin Countries":["Japan","Japan-France","Germany","South Korea","USA","Italy"],"Founded By":["Kiichiro Toyoda","Yokohawa-Kanagawa","German Labour Front","Chung Ju-yung","Henry Ford","Giovanni Agnelli"]})
df
df.loc[4,"Origin Countries"]

'USA'